% Lab1_2

% Очистка робочої пам'яті і закриття графічних вікон
clear; 
close all;

% Розмір зображення та квадратів
N = 200;
size = N/2;

% Ініціалізуємо масив Squares нулями
Squares = uint8(zeros(N,N,3));

% Задаємо вектор зсуву для кожного кольору
N0 = [0.1 0.25 0.4] * N;

% Задаємо діапазон індексів для кожного квадрата
j = 0:size-1;

% Цикл для створення квадратів
for i = 1:3
    Squares(N0(i)+j, N0(i)+j, i) = uint8(255);
end

% Виводимо зображення
imshow(Squares);


