% Lab1_4

% Очистка робочої пам'яті і закриття графічних вікон
clear; 
close all;

% Налаштовання шляху та отримання фото
path ='D:\Study\ЦОЗ\Complete\Lab_1\photo.jpg';
photo = imread(path);

% Створення графічного вікна
figure("Name","Task4","Position",[100,100,600,600]);

%Збільшення інтенсивності кольорів в 1.5 разів
r = cat(3, 1.5 * photo(:,:,1), photo(:,:,2), photo(:,:,3));
g = cat(3, photo(:,:,1), 1.5 * photo(:,:,2), photo(:,:,3));
b = cat(3, photo(:,:,1), photo(:,:,2), 1.5 * photo(:,:,3));

% Відображення оригінального зображення
subplot(2,2,1);
imshow(photo);
axis('image');
title('Оригінал');

% Відображення зображення інтенсивність червого 1,5 
subplot(2,2,2);
imshow(r);
title('Червоний');

% Відображення зображення інтенсивність зеленого 1,5 
subplot(2,2,3);
imshow(g);
title('Зелений');

% Відображення зображення інтенсивність синього 1,5 
subplot(2,2,4);
imshow(b);
title('Синій');
